import java.util.Scanner;
public class Ex03Receipt {
/*	假設這期的統一發票中獎號碼為 01272636、39412201、94586356。
 	請設計一程式讓使用者輸入一組發票號碼即可印出中獎金額。
	(其中末三碼相同獎金 200 元；末四碼相同獎金 1000 元；末五碼相同獎金
	4000 元；末六碼相同獎金 10000 元；末七碼相同獎金 40000 元；號碼全部相同
	獎金 200000 元。*/
	public static void main(String[] args) {
		// TODO Auto-generated method stub
		Scanner scn=new Scanner(System.in);
		int p1[]={0,1,2,7,2,6,3,6};
		int p2[]={3,9,4,1,2,2,0,1};
		int p3[]={9,4,5,8,6,3,5,6};
		String a1=scn.next();
		char a2[]=a1.toCharArray();
		char a[]=new char[8];
		for(int i=0;i<8;i++){
			a[i]=(char) (a2[i]-'0');
		}
			if(a[0]==p1[0]&&a[1]==p1[1]&&a[2]==p1[2]&&a[3]==p1[3]&&a[4]==p1[4]&&a[5]==p1[5]&&a[6]==p1[6]&&a[7]==p1[7]
					||a[0]==p2[0]&&a[1]==p2[1]&&a[2]==p2[2]&&a[3]==p2[3]&&a[4]==p2[4]&&a[5]==p2[5]&&a[6]==p2[6]&&a[7]==p2[7]
							||a[0]==p3[0]&&a[1]==p3[1]&&a[2]==p3[2]&&a[3]==p3[3]&&a[4]==p3[4]&&a[5]==p3[5]&&a[6]==p3[6]&&a[7]==p3[7]){
				System.out.print("恭喜妳中了200000元");
			}else if(a[1]==p1[1]&&a[2]==p1[2]&&a[3]==p1[3]&&a[4]==p1[4]&&a[5]==p1[5]&&a[6]==p1[6]&&a[7]==p1[7]
					||a[1]==p2[1]&&a[2]==p2[2]&&a[3]==p2[3]&&a[4]==p2[4]&&a[5]==p2[5]&&a[6]==p2[6]&&a[7]==p2[7]
							||a[1]==p3[1]&&a[2]==p3[2]&&a[3]==p3[3]&&a[4]==p3[4]&&a[5]==p3[5]&&a[6]==p3[6]&&a[7]==p3[7]){
				System.out.print("恭喜妳中了40000元");
			}else if(a[2]==p1[2]&&a[3]==p1[3]&&a[4]==p1[4]&&a[5]==p1[5]&&a[6]==p1[6]&&a[7]==p1[7]
					||a[2]==p2[2]&&a[3]==p2[3]&&a[4]==p2[4]&&a[5]==p2[5]&&a[6]==p2[6]&&a[7]==p2[7]
							||a[1]==p3[1]&&a[2]==p3[2]&&a[3]==p3[3]&&a[4]==p3[4]&&a[5]==p3[5]&&a[6]==p3[6]&&a[7]==p3[7]){
				System.out.print("恭喜妳中了10000元");
			}else if(a[3]==p1[3]&&a[4]==p1[4]&&a[5]==p1[5]&&a[6]==p1[6]&&a[7]==p1[7]
					||a[3]==p2[3]&&a[4]==p2[4]&&a[5]==p2[5]&&a[6]==p2[6]&&a[7]==p2[7]
							||a[3]==p3[3]&&a[4]==p3[4]&&a[5]==p3[5]&&a[6]==p3[6]&&a[7]==p3[7]){
				System.out.print("恭喜妳中了4000元");
			}else if(a[4]==p1[4]&&a[5]==p1[5]&&a[6]==p1[6]&&a[7]==p1[7]
					||a[4]==p2[4]&&a[5]==p2[5]&&a[6]==p2[6]&&a[7]==p2[7]
							||a[4]==p3[4]&&a[5]==p3[5]&&a[6]==p3[6]&&a[7]==p3[7]){
				System.out.print("恭喜妳中了1000元");
			}else if(a[5]==p1[5]&&a[6]==p1[6]&&a[7]==p1[7]
					||a[5]==p2[5]&&a[6]==p2[6]&&a[7]==p2[7]
							||a[5]==p3[5]&&a[6]==p3[6]&&a[7]==p3[7]){
				System.out.print("恭喜妳中了200元");
			}else{
				System.out.print("抱歉，您沒有中獎");
			}
	}

}
